Revit 2018 API
FabricSheetType.SetLayoutAsCustomPattern Method
Overload List
Name | Description
SetLayoutAsCustomPattern(Double, Double, IList<FabricWireItem>, IList<FabricWireItem>)
 Sets the minor and major layout patterns as Custom, while specifying the needed parameters for this pattern.
SetLayoutAsCustomPattern(Double, Double, Double, Double, IList<FabricWireItem>, IList<FabricWireItem>) |  Obsolete.
 Sets the minor and major layout patterns as Custom, while specifying the needed parameters for this pattern.
See Also
FabricSheetType Class
FabricSheetType Members
Autodesk.Revit.DB.Structure Namespace